;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)


(package! ob-typescript)
(package! js2-mode)
(package! js-import)
(package! web-mode)
(package! react-snippets)
(package! company-tern)
(package! rjsx-mode)
(package! indium)
(package! reason-mode)
(package! prettier-js)
(package! org-fancy-priorities)
(package! move-text)
(package! origami)
(package! org-super-agenda)
(package! dart-mode)
(package! ob-dart)
(package! org-brain)
(package! ascii-art-to-unicode)
(package! wakatime-mode)
(package! doom-themes)
(package! eslint-fix)
(package! ac-js2)
(package! emmet-mode)
(package! doom-modeline)
(package! tabbar)
(package! flutter)
(package! flutter-l10n-flycheck)
(package! dart-mode)
(package! dart-server)
(package! eglot)
(package! lsp-mode)
